In [1]:
import numpy as np
import pandas as pd

In [53]:
cols = ["Degree", 'Grad', "Starting Salary", "Mid Career Salary"]
df = pd.read_csv('salaries_2020.csv', names=cols, index_col = 0)

In [54]:
df.head()

,Degree,Grad,Starting Salary,Mid Career Salary
1,Petroleum Engineering,Bachelors,"$92,300","$182,000"
2,Electrical Engineering & Computer Science (EECS),Bachelors,"$101,200","$152,300"
3,Applied Economics and Management,Bachelors,"$60,900","$139,600"
3,Operations Research,Bachelors,"$78,400","$139,600"
5,Public Accounting,Bachelors,"$60,000","$138,800"

In [55]:
df.count()

Degree               834
Grad                 834
Starting Salary      834
Mid Career Salary    834
dtype: int64

In [56]:
df.shape

(834, 4)

In [57]:
df.dropna()
df.shape

(834, 4)

In [58]:
df['Starting Salary'].describe()

count         834
unique        318
top       $43,900
freq            9
Name: Starting Salary, dtype: object

In [59]:
df["Starting Salary"].replace(',','', regex=True, inplace=True)
df["Starting Salary"].replace('$','', regex=True, inplace=True)

In [60]:
df["Mid Career Salary"].replace(',','', regex=True, inplace=True)
df["Mid Career Salary"].replace('$','', regex=True, inplace=True)

In [61]:
df = df.apply(lambda x: x.str.replace('$', ''))  # Converting all salaries to float.

In [62]:
df['Mid Career Salary'].astype('float64')

1      182000.0
2      152300.0
3      139600.0
3      139600.0
5      138800.0
         ...
830     43300.0
831     42500.0
832     42300.0
833     42200.0
834     38400.0
Name: Mid Career Salary, Length: 834, dtype: float64

In [66]:
df['Starting Salary'] = df['Starting Salary'].astype('float64')
df['Mid Career Salary'] = df['Mid Career Salary'].astype('float64')

In [67]:
df.head()

,Degree,Grad,Starting Salary,Mid Career Salary
1,Petroleum Engineering,Bachelors,92300.0,182000.0
2,Electrical Engineering & Computer Science (EECS),Bachelors,101200.0,152300.0
3,Applied Economics and Management,Bachelors,60900.0,139600.0
3,Operations Research,Bachelors,78400.0,139600.0
5,Public Accounting,Bachelors,60000.0,138800.0

In [69]:
df.describe()

       Starting Salary  Mid Career Salary
count       834.000000         834.000000
mean      49843.045564       82867.505995
std        9727.282745       19870.064395
min       31000.000000       38400.000000
25%       42800.000000       68325.000000
50%       47600.000000       80300.000000
75%       55475.000000       95175.000000
max      101200.000000      182000.000000

In [81]:
df = df.reset_index()

In [82]:
# Identify the highest starting Salary
df['Starting Salary'].max()

101200.0

In [83]:
df.loc[df["Starting Salary"].idxmax()]

index                                                               2
Degree               Electrical Engineering & Computer Science (EECS)
Grad                                                        Bachelors
Starting Salary                                                101200
Mid Career Salary                                              152300
Name: 1, dtype: object

In [84]:
# IDentify the lowest Starting Salary
df['Starting Salary'].min()

31000.0

In [85]:
df.loc[df["Starting Salary"].idxmin()]

index                                     707
Degree               Developmental Psychology
Grad                                Bachelors
Starting Salary                         31000
Mid Career Salary                       62000
Name: 707, dtype: object

In [86]:
df["Spread"] = df["Mid Career Salary"] - df["Starting Salary"]

In [88]:
df.sort_values("Spread", ascending=False).head()

,index,Degree,Grad,Starting Salary,Mid Career Salary,Spread
0,1,Petroleum Engineering,Bachelors,92300.0,182000.0,89700.0
12,13,Aerospace Studies,Bachelors,50300.0,130300.0,80000.0
4,5,Public Accounting,Bachelors,60000.0,138800.0,78800.0
2,3,Applied Economics and Management,Bachelors,60900.0,139600.0,78700.0
27,28,Building Science,Bachelors,51100.0,122500.0,71400.0

In [89]:
df.sort_values("Spread", ascending=True).head()

,index,Degree,Grad,Starting Salary,Mid Career Salary,Spread
833,834,Metalsmithing,Bachelors,38300.0,38400.0,100.0
832,833,Addictions Counseling,Bachelors,38800.0,42200.0,3400.0
721,720,Psychiatry,Bachelors,54700.0,61200.0,6500.0
818,819,Human Services Management,Bachelors,43500.0,50500.0,7000.0
831,832,Medical Assisting,Bachelors,35100.0,42300.0,7200.0